<template>
  <div class="testPage_wrap">
    <div class="container">
      <div class="testPage_header">
        <router-link to="/service" class="link_back">
          <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
            <path fill-rule="evenodd" clip-rule="evenodd" d="M3.46934 11.4692C3.32889 11.6098 3.25 11.8004 3.25 11.9992C3.25 12.1979 3.32889 12.3886 3.46934 12.5292L9.46934 18.5292C9.538 18.6029 9.6208 18.662 9.7128 18.703C9.8048 18.7439 9.90412 18.766 10.0048 18.7678C10.1055 18.7695 10.2055 18.751 10.2989 18.7133C10.3923 18.6756 10.4772 18.6194 10.5484 18.5482C10.6196 18.477 10.6757 18.3922 10.7135 18.2988C10.7512 18.2054 10.7697 18.1054 10.7679 18.0047C10.7662 17.904 10.7441 17.8046 10.7031 17.7126C10.6621 17.6206 10.603 17.5378 10.5293 17.4692L5.80934 12.7492H19.9993C20.1983 12.7492 20.389 12.6702 20.5297 12.5295C20.6703 12.3889 20.7493 12.1981 20.7493 11.9992C20.7493 11.8003 20.6703 11.6095 20.5297 11.4688C20.389 11.3282 20.1983 11.2492 19.9993 11.2492H5.80934L10.5293 6.52918C10.603 6.46052 10.6621 6.37771 10.7031 6.28571C10.7441 6.19372 10.7662 6.0944 10.7679 5.9937C10.7697 5.893 10.7512 5.79297 10.7135 5.69958C10.6757 5.60619 10.6196 5.52136 10.5484 5.45014C10.4772 5.37892 10.3923 5.32278 10.2989 5.28505C10.2055 5.24733 10.1055 5.22881 10.0048 5.23059C9.90412 5.23236 9.8048 5.2544 9.7128 5.2954C9.6208 5.33639 9.538 5.39549 9.46934 5.46918L3.46934 11.4692Z" fill="white" fill-opacity="0.6"/>
          </svg>
          Вернуться назад
        </router-link>
        <p class="testPage_title">
          Тест на уровень А1
        </p>
      </div>
      <div class="testPage_body">
        <div class="testPage_body__rotate">
          <span class="rotate_text rotate_first">Изучаешь</span>
          <span class="rotate_text rotate_second">русский</span>
          <span class="rotate_text rotate_first">язык?</span>
        </div>
        <p class="">Проверь уровень знания с помощью нашего теста!</p>
        <p>Для получения наиболее точной оценки уровня владения языком, рекомендуем честно отвечать на вопросы без использования словарей и прочих материалов. </p>
        <p>После завершения теста, вы получите результаты, отражающие ваши текущие знания. Это поможет лучше планировать дальнейшее изучение и ставить цели.</p>
      </div>
      <button>Начать</button>
    </div>
  </div>

</template>
<script setup>

</script>
<style scoped>

</style>
