<template>
    <div v-for="(question, index) in questions" :key="question.title" class="faq__block">
        <button @click="() => handleAccordion(index)" class="btn-reset faq__question flex">
            {{ question.title }}

            <svg v-if="question.isExpanded" width="40" height="40" viewBox="0 0 40 40" fill="none"
                 xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M19.0948 13.4503L5.81985 27.3828C5.59824 27.6152 5.47461 27.9241 5.47461 28.2453C5.47461 28.5664 5.59824 28.8753 5.81985 29.1077L5.83485 29.1228C5.94228 29.2358 6.0716 29.3259 6.21493 29.3874C6.35826 29.449 6.51261 29.4807 6.6686 29.4807C6.82458 29.4807 6.97893 29.449 7.12227 29.3874C7.2656 29.3259 7.39491 29.2358 7.50235 29.1228L20.0023 16.0028L32.4973 29.1228C32.6048 29.2358 32.7341 29.3259 32.8774 29.3874C33.0208 29.449 33.1751 29.4807 33.3311 29.4807C33.4871 29.4807 33.6414 29.449 33.7848 29.3874C33.9281 29.3259 34.0574 29.2358 34.1648 29.1228L34.1798 29.1077C34.4015 28.8753 34.5251 28.5664 34.5251 28.2453C34.5251 27.9241 34.4015 27.6152 34.1798 27.3828L20.9048 13.4503C20.7881 13.3277 20.6477 13.2302 20.4921 13.1635C20.3366 13.0969 20.1691 13.0625 19.9998 13.0625C19.8306 13.0625 19.6631 13.0969 19.5076 13.1635C19.352 13.2302 19.2116 13.3277 19.0948 13.4503Z"
                    fill="#5724A7"/>
            </svg>
            <svg v-else width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M19.0948 26.5497L5.81985 12.6172C5.59824 12.3848 5.47461 12.0759 5.47461 11.7547C5.47461 11.4336 5.59824 11.1247 5.81985 10.8923L5.83485 10.8772C5.94228 10.7642 6.0716 10.6741 6.21493 10.6126C6.35826 10.551 6.51261 10.5193 6.6686 10.5193C6.82458 10.5193 6.97893 10.551 7.12227 10.6126C7.2656 10.6741 7.39491 10.7642 7.50235 10.8772L20.0023 23.9972L32.4973 10.8772C32.6048 10.7642 32.7341 10.6741 32.8774 10.6126C33.0208 10.551 33.1751 10.5193 33.3311 10.5193C33.4871 10.5193 33.6414 10.551 33.7848 10.6126C33.9281 10.6741 34.0574 10.7642 34.1648 10.8772L34.1798 10.8923C34.4015 11.1247 34.5251 11.4336 34.5251 11.7547C34.5251 12.0759 34.4015 12.3848 34.1798 12.6172L20.9048 26.5497C20.7881 26.6723 20.6477 26.7698 20.4921 26.8365C20.3366 26.9031 20.1691 26.9375 19.9998 26.9375C19.8306 26.9375 19.6631 26.9031 19.5076 26.8365C19.352 26.7698 19.2116 26.6723 19.0948 26.5497Z"
                    fill="#5724A7"/>
            </svg>


        </button>
        <Collapse :when="questions[index].isExpanded" class="collapse">
            <p class="faq__answer">
                {{ question.answer }}
            </p>
        </Collapse>
    </div>
</template>

<script setup>
import {reactive} from 'vue'
import {Collapse} from 'vue-collapsed'

const questions = reactive([
    {
        id: 1,
        title: 'Какие варианты оплаты предусмотрены на сайте?',
        answer: 'Оплатить можно двумя способами: банковской картой через сервис Робокасса или через PayPal.',
        isExpanded: false
    },
    {
        id: 2,
        title: 'Как можно использовать промо-код?',
        answer: 'Промо-код можно использовать для получения скидки при покупке онлайн-учебника.',
        isExpanded: false
    },
    {
        id: 3,
        title: 'Какие способы доставки предусмотрены для печатной версии учебника?',
        answer: 'Вы можете выбрать самовывоз из офиса или отправку почтовыми службами для получения печатной версии учебника.',
        isExpanded: false
    },
    {
        id: 4,
        title: 'Можно ли продлить ранее приобретенный доступ?',
        answer: 'Ранее приобретённый доступ можно продлить бесплатно на неделю или приобрести повторно доступ на год.',
        isExpanded: false
    },
    {
        id: 5,
        title: 'Сколько человек может работать с онлайн-учебником?',
        answer: 'Интерактивная версия учебника является индивидуальной подпиской и рассчитана на работу одного человека: учителя или студента.',
        isExpanded: false
    },
    {
        id: 6,
        title: 'Можно скачать и распечатать онлайн-учебник?',
        answer: 'Скачивание и печать онлайн-учебника не предусмотрена. Им можно пользоваться только на платформе сайта в режиме онлайн.',
        isExpanded: false
    },
    {
        id: 7,
        title: 'Можно ли ознакомиться с содержанием учебника?',
        answer: 'Ознакомительный фрагмент учебника представлен на сайте.',
        isExpanded: false
    },
    {
        id: 8,
        title: 'Можно ли заключить договор на покупку учебника?',
        answer: 'На сайте есть договор оферты. Для юр. лиц можем направить проект договора.',
        isExpanded: false
    },
])

function handleAccordion(selectedIndex) {
    questions.forEach((_, index) => {
        questions[index].isExpanded = index === selectedIndex ? !questions[index].isExpanded : false
    })
}

</script>
