const allNews = [
                    {
                        id: 0,
                        tag: 'Анонсы',
                        title: 'Прошёл турнир по русскому языку в области науки',
                        desc: 'Научно-практическая конференция «Теория и практика просветительской работы в гражданском и патриотическом воспитании в современной школе»',
                        image: '../img/preview-1.webp',
                        video: 'https://www.youtube.com/embed/GNrdg3PzpJQ?si=HfEDMQxvZzphSm84'
                    },
                    {
                        id: 1,
                        tag: 'Мероприятия',
                        title: 'Прошёл турнир по русскому языку в области науки',
                        desc: 'Фестиваль русского языка «Грамотные выходные» пройдёт в Калининградской области',
                        image: '../img/event-1.webp',
                        video: ''
                    },
                    {
                        id: 2,
                        tag: 'Новости',
                        title: 'Прошёл турнир по русскому языку в области науки',
                        desc: 'Русский язык занимает значимое место среди иностранных языков в школах стран ЕАЭС',
                        image: '../img/new-1.webp',
                        video: ''
                    },
                    {
                        id: 3,
                        tag: 'Новости',
                        title: 'Прошёл турнир по русскому языку в области науки',
                        desc: 'Центр открытого образования на русском языке начал работу в Алжире',
                        image: '../img/new-2.webp',
                        video: ''
                    },
                    {
                        id: 4,
                        tag: 'Новости',
                        title: 'Прошёл турнир по русскому языку в области науки',
                        desc: 'Новый взгляд на воспитание: состоялась конференция «Теория и практика просветительской работы в гражданском и патриотическом воспитании в современной школе»',
                        image: '../img/new-3.webp',
                        video: ''
                    },

                    {
                        id: 5,
                        tag: 'Анонсы',
                        title: 'Прошёл турнир по русскому языку в области науки',
                        desc: 'Научно-практическая конференция «Теория и практика просветительской работы в гражданском и патриотическом воспитании в современной школе»',
                        image: '../img/preview-1.webp',
                        video: ''
                    },
                    {
                        id: 6,
                        tag: 'Мероприятия',
                        title: 'Прошёл турнир по русскому языку в области науки',
                        desc: 'Фестиваль русского языка «Грамотные выходные» пройдёт в Калининградской области',
                        image: '../img/event-1.webp',
                        video: ''
                    },
                    {
                        id: 7,
                        tag: 'Новости',
                        title: 'Прошёл турнир по русскому языку в области науки',
                        desc: 'Русский язык занимает значимое место среди иностранных языков в школах стран ЕАЭС',
                        image: '../img/new-1.webp',
                        video: ''
                    },
                    {
                        id: 8,
                        tag: 'Новости',
                        title: 'Прошёл турнир по русскому языку в области науки',
                        desc: 'Центр открытого образования на русском языке начал работу в Алжире',
                        image: '../img/new-2.webp',
                        video: ''
                    },
                    {
                        id: 9,
                        tag: 'Новости',
                        title: 'Прошёл турнир по русскому языку в области науки',
                        desc: 'Новый взгляд на воспитание: состоялась конференция «Теория и практика просветительской работы в гражданском и патриотическом воспитании в современной школе»',
                        image: '../img/new-3.webp',
                        video: ''
                    },
                ]


export default allNews